// import HERO_DATA from "../assets/hero-data.json" assert { type: 'json' };
// import TERRAIN from "../assets/map.json" assert { type: 'json' };
// import TERRAIN_INFO from "../assets/terrain-info.json" assert { type: 'json' };
// import DECK from "../assets/deck.json" assert { type: 'json' };

// 地形
const TERRAIN = {
    "野战": [
        ["驿站", "平原", "树林", "山岭", "平原", "军营-蓝方", "大本营-蓝方"],
        ["平原", "平原", "树林", "湖泊", "树林", "平原", "军营-蓝方"],
        ["树林", "平原", "山岭", "平原", "平原", "箭塔", "平原"],
        ["平原", "山岭", "湖泊", "平原", "湖泊", "山岭", "平原"],
        ["平原", "箭塔", "平原", "平原", "山岭", "平原", "树林"],
        ["军营-红方", "平原", "树林", "湖泊", "树林", "平原", "平原"],
        ["大本营-红方", "军营-红方", "平原", "山岭", "树林", "平原", "驿站"]
    ],
    "攻城": [
        ["投石车", "平原", "箭塔", "平原", "军营-蓝方", "军营-蓝方", "大本营-蓝方"],
        ["平原", "箭塔", "平原", "城墙-蓝方", "城墙-蓝方", "城墙-蓝方", "平原"],
        ["粮仓", "平原", "平原", "护城河", "护城河", "平原", "拒马刺-下"],
        ["平原", "粮仓", "平原", "平原", "平原", "粮仓", "平原"],
        ["拒马刺-上", "平原", "护城河", "护城河", "平原", "平原", "粮仓"],
        ["平原", "城墙-红方", "城墙-红方", "城墙-红方", "平原", "箭塔", "平原"],
        ["大本营-红方", "军营-红方", "军营-红方", "平原", "箭塔", "平原", "投石车"]
    ],
    "水战": [
        ["湖泊", "水寨", "平原", "瞭望塔", "平原", "军营-蓝方", "大本营-蓝方"],
        ["江面", "江面", "江面", "湖泊", "平原", "平原", "军营-蓝方"],
        ["礁石", "江面", "江面", "江面", "江面", "水寨", "平原"],
        ["江面", "江面", "礁石", "祭坛", "礁石", "江面", "江面"],
        ["平原", "水寨", "江面", "江面", "江面", "江面", "礁石"],
        ["军营-红方", "平原", "平原", "湖泊", "江面", "江面", "江面"],
        ["大本营-红方", "军营-红方", "平原", "瞭望塔", "平原", "水寨", "湖泊"]
    ],
    "马战": [
        ["烽火台", "湖泊", "沙地", "平原", "树林", "军营-蓝方", "大本营-蓝方"],
        ["平原", "平原", "平原", "沙地", "平原", "平原", "军营-蓝方"],
        ["湖泊", "平原", "沙地", "平原", "平原", "树林", "平原"],
        ["树林", "平原", "平原", "烽火台", "平原", "平原", "树林"],
        ["平原", "树林", "平原", "平原", "沙地", "平原", "湖泊"],
        ["军营-红方", "平原", "平原", "沙地", "平原", "平原", "平原"],
        ["大本营-红方", "军营-红方", "树林", "平原", "沙地", "湖泊", "烽火台"]
    ],
    "车战": [
        ["马厩", "平原", "平原", "平原", "大纛", "军营-蓝方", "大本营-蓝方"],
        ["平原", "拒马刺-下", "湖泊", "平原", "拒马刺-下", "平原", "军营-蓝方"],
        ["湖泊", "战鼓", "擂台", "擂台", "擂台", "战鼓", "平原"],
        ["平原", "平原", "擂台", "擂台", "擂台", "平原", "平原"],
        ["平原", "战鼓", "擂台", "擂台", "擂台", "战鼓", "湖泊"],
        ["军营-红方", "平原", "拒马刺-上", "平原", "湖泊", "拒马刺-上", "平原"],
        ["大本营-红方", "军营-红方", "大纛", "平原", "平原", "平原", "马厩"]
    ],
    "步战": [
        ["军营-蓝方", "平原", "湖泊", "校场-蓝方", "平原", "粮道-蓝方", "大本营-蓝方"],
        ["湖泊", "高地", "平原", "平原", "点将台-蓝方", "平原", "军营-蓝方"],
        ["高地", "平原", "平原", "平原", "平原", "校场-蓝方", "平原"],
        ["高地", "平原", "平原", "前锋校场", "平原", "平原", "高地"],
        ["平原", "校场-红方", "平原", "平原", "平原", "平原", "高地"],
        ["军营-红方", "平原", "点将台-红方", "平原", "平原", "高地", "湖泊"],
        ["大本营-红方", "粮道-红方", "平原", "校场-红方", "湖泊", "平原", "军营-红方"]
    ]
};

// 地形信息
const TERRAIN_INFO = {
    "平原": {
        "className": "plain",
        "地形效果": "无地形效果。",
        "neutral": true,
        "color": "#A9C18E",
        "icon": "class='far fa-clone'"
    },
    "树林": {
        "className": "grove",
        "地形效果": "位于此地形的角色需要使用或打出【闪】时，其可以进行判定，若结果为红桃，视为其使用或打出了一张普【闪】。位于此地形的角色受到火焰伤害时，此伤害值+1。",
        "neutral": true,
        "color": "#1B8643",
        "icon": "class='fas fa-tree'"
    },
    "山岭": {
        "className": "ridge",
        "地形效果": "该地形不能成为移动路径的终点或转移的目标点。",
        "neutral": true,
        "color": "#606060",
        "icon": "class='fas fa-mountain'"
    },
    "湖泊": {
        "className": "lake",
        "地形效果": "位于此地形的角色的摸牌阶段开始前，跳过此阶段。位于此地形的角色的结束阶段，该角色回复1点体力。",
        "neutral": true,
        "color": "#1EC5F1",
        "icon": "class='fas fa-water'"
    },
    "箭塔": {
        "className": "arrow-tower",
        "地形效果": "位于此地形的角色的出牌阶段内，若其装备区有武器或视为装备着武器，此阶段内武器失效，且其于此阶段内使用的第一张【杀】无距离限制；否则其于此阶段内使用的第一张【杀】可以选择与其位于同一直线的其他角色为目标。",
        "neutral": true,
        "color": "#CCB700",
        "icon": "class='fas fa-tower-observation'"
    },
    "驿站": {
        "className": "post-station",
        "地形效果": "位于此地形的角色的结束阶段，该角色观看牌堆顶的一张牌，然后将此牌交给一名角色。",
        "neutral": true,
        "color": "#CD853F",
        "icon": "class='fas fa-signs-post'"
    },
    "军营": {
        "className": "barrack",
        "地形效果": "此地形区分阵营。可以容纳任意名角色。",
        "neutral": false,
        "color": "#000000",
        "icon": "class='fas fa-tents'"
    },
    "大本营": {
        "className": "base",
        "地形效果": "此地形区分阵营。游戏开始时，生成对应阵营的帅旗。当另一阵营的帅旗进入此地形时，将此帅旗转移至该阵营的大本营，并使该阵营获得5分。可以容纳任意名角色。",
        "neutral": false,
        "color": "#000000",
        "icon": "class='fas fa-tent'"
    },
    "城墙": {
        "className": "wall",
        "地形效果": "位于此地形的角色的出牌阶段限一次，其可以将一张黑色牌当一张普【杀】使用。位于护城河地形的角色使用的普【杀】对位于此地形的目标角色的结算开始时，此【杀】对此目标无效。",
        "neutral": true,
        "color": "#708090",
        "icon": "class='fas fa-square-xmark'"
    },
    "护城河": {
        "className": "moat",
        "地形效果": "位于此地形的角色不能使用或打出【闪】。位于此地形的角色的出牌阶段限一次，其可以弃置一张牌，然后其摸一张牌。",
        "neutral": true,
        "color": "#00CED1",
        "icon": "class='fas fa-water'"
    },
    "投石车": {
        "className": "catapult",
        "地形效果": "位于此地形的角色的出牌阶段内，其使用【杀】可以选择位于城墙地形的角色。当位于此地形的角色使用的【杀】被位于城墙地形的目标角色使用的【闪】响应时，弃置目标角色装备区里的所有牌。",
        "neutral": true,
        "color": "#999999",
        "icon": "class='fas fa-truck-ramp-box'"
    },
    "粮仓": {
        "className": "granary",
        "地形效果": "位于此地形的角色的移动阶段开始时，其多获得1点移动力。位于此地形的角色受到火焰伤害时，此伤害值+1。",
        "neutral": true,
        "color": "#FCFF00",
        "icon": "class='fas fa-warehouse'"
    },
    "拒马刺": {
        "className": "caltrop",
        "地形效果": "当一名角色移动一步前，若拒马刺不是此次移动的起点且此步移动的方向与此地形的指示箭头方向不同，终止此次移动。",
        "neutral": true,
        "color": "#705D78",
        "icon": "class='fas fa-road-spikes'"
    },
    "水寨": {
        "className": "water-stockade",
        "地形效果": "位于此地形的角色的准备阶段，其弃置一张手牌。位于此地形的角色的摸牌阶段，其多摸一张牌。",
        "neutral": true,
        "color": "#005C8B",
        "icon": "class='fas fa-anchor'"
    },
    "瞭望塔": {
        "className": "watchtower",
        "地形效果": "位于此地形的角色的出牌阶段限一次，其可以观看牌堆底的一张牌。",
        "neutral": true,
        "color": "#DDD700",
        "icon": "class='fas fa-eye'"
    },
    "江面": {
        "className": "river",
        "地形效果": "在“起风”结算中，所有位于此地形的角色向风向方向移动一格（不能执行则不移动）。",
        "neutral": true,
        "color": "#1EF1EE",
        "icon": "class='fas fa-water'"
    },
    "礁石": {
        "className": "reef",
        "地形效果": "该地形不能成为移动路径的终点或转移的目标点。当位于江面的角色执行“起风”结算的移动时，若一名角色因此地形而无法移动，其失去1点体力。",
        "neutral": true,
        "color": "#2F4F4F",
        "icon": "class='fas fa-mound'"
    },
    "祭坛": {
        "className": "altar",
        "地形效果": "位于此地形的角色的出牌阶段限一次，其可以将一张手牌置于牌堆底，然后其摸一张牌。",
        "neutral": true,
        "color": "#8A2BE2",
        "icon": "class='fas fa-yin-yang'"
    },
    "沙地": {
        "className": "sand",
        "地形效果": "位于此地形的角色成为其他角色使用【杀】的目标后，若此目标角色与此【杀】的使用者的距离大于1，此目标角色不能响应此【杀】。位于此地形的角色受到火焰伤害时，防止之。",
        "neutral": true,
        "color": "#ACA766",
        "icon": "class='fad fa-square'"
    },
    "烽火台": {
        "className": "beacon",
        "地形效果": "位于此地形的角色的结束阶段，将此地形改为由己方阵营控制，然后：如果此地形原先未被控制，其明置敌方阵营的一名角色的手牌（若己方阵营有被明置手牌的角色，则改为选择暗置己方阵营的一名角色的手牌）；如果此区域原先由敌方阵营控制，则依次执行上述操作两次。",
        "neutral": true,
        "color": "#F77838",
        "icon": "class='fad fa-square'"
    },
    "哨卡": {
        "className": "outpost",
        "地形效果": "此地形区分阵营。与哨卡阵营不同的角色无法因非地形效果拆除哨卡。当一名角色移动一步后，若其位于阵营不同的哨卡，终止此次移动。当一名角色移动结束时，若其位于阵营不同的哨卡，此次移动无法触发“骑兵”效果。此地形可以通过在平原地形建造“工事”得到。",
        "neutral": false,
        "color": "#99B17E",
        "icon": "class='fad fa-square'"
    },
    "掷火器": {
        "className": "fire-thrower",
        "地形效果": "位于此地形的角色出牌阶段限一次，该角色可以弃置一张红色手牌，然后其视为使用一张普【杀】，此【杀】可以选择距离3以内的一名其他角色或一个有“工事”的区域为目标：若目标为其他角色，则此【杀】造成伤害前，此伤害改为火焰伤害；若目标为有“工事”的区域，则此【杀】的效果改为拆除该区域的“工事”。此地形可以通过在树林地形建造“工事”得到。",
        "neutral": true,
        "color": "#054C06",
        "icon": "class='fad fa-square'"
    },
    "土城": {
        "className": "bunker",
        "地形效果": "若一个区域为此地形且有角色，其敌对阵营角色无法以任何形式进入此区域。当位于此地形的角色受到黑【杀】造成的伤害时，防止之。此地形可以通过在沙地地形建造“工事”得到。",
        "neutral": true,
        "color": "#9C9756",
        "icon": "class='fad fa-square'"
    },
    "战鼓": {
        "className": "drum",
        "地形效果": "位于此地形的角色的出牌阶段限一次，其可以将一张手牌交给位于擂台地形的己方阵营角色。",
        "neutral": true,
        "color": "#995C4E",
        "icon": "class='fad fa-square'"
    },
    "擂台": {
        "className": "arena",
        "地形效果": "与位于此地形的角色阵营相同的另一名角色不能以任何形式进入擂台。擂台上的角色使用牌或发动技能的目标不能是不位于擂台地形的角色；不位于擂台地形的角色使用牌的目标不能是位于擂台地形的角色；不位于战鼓地形和擂台地形的角色发动技能的目标不能是位于擂台地形的角色。",
        "neutral": true,
        "color": "#800000",
        "icon": "class='fad fa-square'"
    },
    "大纛": {
        "className": "banner",
        "地形效果": "每回合限一次，当一名角色于其回合内途经此地形时（即此地形既不是起点也不是终点），该角色获得效果：本回合你使用的下一张【杀】的伤害基数+1。",
        "neutral": true,
        "color": "#C34347",
        "icon": "class='fad fa-square'"
    },
    "马厩": {
        "className": "stable",
        "地形效果": "位于此地形的角色的结束阶段，其可以执行一次步数至多为3的移动。",
        "neutral": true,
        "color": "#D2691E",
        "icon": "class='fad fa-horse'"
    },
    "校场": {
        "className": "ground",
        "地形效果": "此地形区分阵营。游戏开始时，在此地形放置一个对应阵营的“步旅”。",
        "neutral": false,
        "color": "#FFAE90",
        "icon": "class='fad fa-square'"
    },
    "前锋校场": {
        "className": "vanguard-ground",
        "地形效果": "位于此地形的角色的结束阶段，将此地形改为由己方阵营控制。被控制的前锋校场视为该阵营的校场。",
        "neutral": true,
        "color": "#FFAE90",
        "icon": "class='fad fa-square'"
    },
    "点将台": {
        "className": "command-platform",
        "地形效果": "此地形区分阵营。位于此地形的对应阵营角色的回合开始时，选择一个没有“步旅”的对应阵营校场（若该角色的体力上限为3，则改为选择两个），在目标校场放置一个“步旅”。",
        "neutral": false,
        "color": "#AD3523",
        "icon": "class='fad fa-square'"
    },
    "粮道": {
        "className": "grain-path",
        "地形效果": "此地形区分阵营。位于此地形的角色出牌阶段限一次，其可以弃置一张方块牌，然后移除对应阵营的所有“步旅”。",
        "neutral": false,
        "color": "#9ADD32",
        "icon": "class='fad fa-square'"
    },
    "高地": {
        "className": "highland",
        "地形效果": "位于此地形的角色使用射【杀】无距离限制。位于此地形的角色移动己方“步旅”至敌方“步旅”所在区域时，仅移除敌方“步旅”。",
        "neutral": true,
        "color": "#B49265",
        "icon": "class='fad fa-square'"
    }
};

// 英雄数据
const HERO_DATA = {
    "曹操": {
        "势力": "魏",
        "称号": "魏武帝",
        "体力上限": 4,
        "性别": "男",
        "拼音": "caocao",
        "分包": "标准",
        "技能": {
            "奸雄": "当你受到伤害后，你可以获得对你造成伤害的牌。"
        }
    },
    "司马懿": {
        "势力": "魏",
        "称号": "狼顾之鬼",
        "体力上限": 3,
        "性别": "男",
        "拼音": "simayi",
        "分包": "标准",
        "技能": {
            "伏膺": "当你受到伤害后，你可以获得一名其他角色的一张牌，然后若此伤害的伤害来源是己方角色，你进行判定，若结果为红桃，你回复1点体力。",
            "鬼才": "当一张判定牌生效前，你可以打出一张手牌代替之。"
        }
    },
    "夏侯惇": {
        "势力": "魏",
        "称号": "独眼的罗剎",
        "体力上限": 4,
        "性别": "男",
        "拼音": "xiahoudun",
        "分包": "标准",
        "技能": {
            "刚烈": "当你受到伤害后，你可以进行一次判定，若结果不为红桃，伤害来源选择一项：1.弃置两张手牌；2.受到你造成的1点普通伤害。"
        }
    },
    "张辽": {
        "势力": "魏",
        "称号": "前将军",
        "体力上限": 4,
        "性别": "男",
        "拼音": "zhangliao",
        "分包": "标准",
        "技能": {
            "突袭": "摸牌阶段，你可以放弃摸牌，然后获得至多两名与你的距离为<3>以内的其他角色的各一张手牌。"
        }
    },
    "许褚": {
        "势力": "魏",
        "称号": "虎痴",
        "体力上限": 4,
        "性别": "男",
        "拼音": "xuchu",
        "分包": "标准",
        "技能": {
            "裸衣": "摸牌阶段，你可以放弃摸牌，然后亮出牌堆顶的两张牌并获得其中一张；若如此做，直到你的下回合开始，当你因【杀】或【决斗】的效果对一名目标角色造成伤害时，此伤害值+1。"
        }
    },
    "郭嘉": {
        "势力": "魏",
        "称号": "早终的先知",
        "体力上限": 3,
        "性别": "男",
        "拼音": "guojia",
        "分包": "标准",
        "技能": {
            "劳征": "锁定技，移动阶段开始时，你进行一次判定：若结果为红色，此阶段你改为获得3点移动力；若结果为黑色，你受到1点普通伤害。",
            "遗计": "当你受到1点伤害后，你可以观看牌堆顶的两张牌，然后将这些牌任意分配给与你的距离为<3>以内的角色。"
        }
    },
    "甄姬": {
        "势力": "魏",
        "称号": "薄幸的美人",
        "体力上限": 3,
        "性别": "女",
        "拼音": "zhenji",
        "分包": "标准",
        "技能": {
            "倾国": "你可以将一张黑色手牌当一张普【闪】使用或打出。",
            "洛神": "准备阶段，你可以进行一次判定，若结果为黑色，你获得此牌，且你可以重复此流程。"
        }
    },
    "曹纯": {
        "势力": "魏",
        "称号": "虎豹骑首",
        "体力上限": 4,
        "性别": "男",
        "拼音": "caochun",
        "分包": "标准",
        "技能": {
            "骁锐": "一名其他己方角色的回合开始时，若该角色与你的距离为<2>以内，该角色可以于本回合获得以下效果：移动阶段开始时，其多获得1点移动力；当其声明使用普【杀】时，视为其攻击范围+1。"
        }
    },
    "典韦": {
        "势力": "魏",
        "称号": "古之恶来",
        "体力上限": 4,
        "性别": "男",
        "拼音": "dianwei",
        "分包": "众筹解锁",
        "技能": {
            "威严": "锁定技，当你因【杀】的效果对一名目标角色造成伤害时，若除该角色以外，该角色距离1范围内没有其他与你阵营不同的角色，此伤害值+1。",
            "恶来": "锁定技，当你所在阵营因你击杀敌方角色而得分时，此分数+1。"
        }
    },
    "刘备": {
        "势力": "蜀",
        "称号": "乱世的枭雄",
        "体力上限": 4,
        "性别": "男",
        "拼音": "liubei",
        "分包": "标准",
        "技能": {
            "仁德": "出牌阶段限一次，你可以将任意张手牌交给一名与你的距离为<3>以内的其他角色，然后若你以此法给出至少两张牌，你回复1点体力。"
        }
    },
    "关羽": {
        "势力": "蜀",
        "称号": "美髯公",
        "体力上限": 4,
        "性别": "男",
        "拼音": "guanyu",
        "分包": "标准",
        "技能": {
            "武圣": "你可以将一张红色牌当一张普【杀】使用或打出。"
        }
    },
    "张飞": {
        "势力": "蜀",
        "称号": "万夫不当",
        "体力上限": 4,
        "性别": "男",
        "拼音": "zhangfei",
        "分包": "标准",
        "技能": {
            "喝断": "与你位于同一直线的敌方角色的移动阶段开始前，你可以与该角色拼点：若你赢，其跳过此阶段；若你没赢，你与其分别获得对方拼点的牌。"
        }
    },
    "诸葛亮": {
        "势力": "蜀",
        "称号": "迟暮的丞相",
        "体力上限": 3,
        "性别": "男",
        "拼音": "zhugeliang",
        "分包": "标准",
        "技能": {
            "观星": "准备阶段，你可以观看牌堆顶的五张牌（若你已受伤，则改为三张），然后将其中任意张牌以任意顺序置于牌堆顶，并将其余的牌以任意顺序置于牌堆底。",
            "空城": "锁定技，若你没有手牌，你不能成为【杀】或【决斗】的目标。"
        }
    },
    "赵云": {
        "势力": "蜀",
        "称号": "少年将军",
        "体力上限": 4,
        "性别": "男",
        "拼音": "zhaoyun",
        "分包": "标准",
        "技能": {
            "龙胆": "你可以将一张【杀】当一张普【闪】使用或打出，或将一张【闪】当一张普【杀】使用或打出。"
        }
    },
    "马超": {
        "势力": "蜀",
        "称号": "一骑当千",
        "体力上限": 4,
        "性别": "男",
        "拼音": "machao",
        "分包": "标准",
        "技能": {
            "马术": "出牌阶段，你可以消耗任意点移动力，然后你执行一次等量步数的移动。",
            "铁骑": "当你使用【杀】指定一名角色为目标后，你可以进行判定，若结果为红色，该角色不能响应此【杀】。"
        }
    },
    "黄月英": {
        "势力": "蜀",
        "称号": "归隐的杰女",
        "体力上限": 3,
        "性别": "女",
        "拼音": "huangyueying",
        "分包": "标准",
        "技能": {
            "集智": "当你使用普通锦囊牌时，你可以摸一张牌。",
            "奇才": "锁定技，你使用锦囊牌的距离限制+1。"
        }
    },
    "黄忠": {
        "势力": "蜀",
        "称号": "老当益壮",
        "体力上限": 4,
        "性别": "男",
        "拼音": "huangzhong",
        "分包": "众筹解锁",
        "技能": {
            "神弓": "你可以将一张【杀】当一张射【杀】使用。",
            "穿杨": "锁定技，若你的装备区里有武器牌，你使用的【杀】不可被响应。"
        }
    },
    "孙乾": {
        "势力": "蜀",
        "称号": "雍容凤仪",
        "体力上限": 3,
        "性别": "男",
        "拼音": "sunqian",
        "分包": "众筹解锁",
        "技能": {
            "奔命": "锁定技，移动阶段开始时，你改为获得4点移动力。",
            "归营": "结束阶段，你可以转移至己方大本营，然后你摸一张牌。"
        }
    },
    "孙权": {
        "势力": "吴",
        "称号": "年轻的贤君",
        "体力上限": 4,
        "性别": "男",
        "拼音": "sunquan",
        "分包": "标准",
        "技能": {
            "制衡": "出牌阶段限一次，你可以弃置至多X张牌（X为你的体力值），然后你摸等量的牌。"
        }
    },
    "甘宁": {
        "势力": "吴",
        "称号": "锦帆游侠",
        "体力上限": 4,
        "性别": "男",
        "拼音": "ganning",
        "分包": "标准",
        "技能": {
            "奇袭": "你可以将一张黑色牌当一张【过河拆桥】使用，此牌结算结束后，本回合你使用【过河拆桥】的距离限制-1。"
        }
    },
    "吕蒙": {
        "势力": "吴",
        "称号": "白衣渡江",
        "体力上限": 4,
        "性别": "男",
        "拼音": "lvmeng",
        "分包": "标准",
        "技能": {
            "渡江": "当你于回合内声明你执行的移动时，你可以将一步出发点为湖泊的移动的停留点改为另一个湖泊；若你本回合以此法移动过，本回合你使用【杀】的距离限制改为1且你使用的第一张【杀】伤害基数+1。"
        }
    },
    "黄盖": {
        "势力": "吴",
        "称号": "轻身为国",
        "体力上限": 4,
        "性别": "男",
        "拼音": "huanggai",
        "分包": "标准",
        "技能": {
            "苦肉": "出牌阶段，你可以失去1点体力，然后你摸两张牌。"
        }
    },
    "周瑜": {
        "势力": "吴",
        "称号": "大都督",
        "体力上限": 3,
        "性别": "男",
        "拼音": "zhouyu",
        "分包": "标准",
        "技能": {
            "英姿": "锁定技，你的摸牌阶段不会因任何效果被跳过。摸牌阶段，你多摸一张牌。",
            "反间": "出牌阶段限一次，你可以令一名与你的距离为<3>以内的其他角色选择一种花色，然后该角色获得你的一张手牌并展示之，若此牌的花色与其选择的花色不同，则你对其造成1点普通伤害。"
        }
    },
    "大乔": {
        "势力": "吴",
        "称号": "矜持之花",
        "体力上限": 3,
        "性别": "女",
        "拼音": "daqiao",
        "分包": "标准",
        "技能": {
            "国色": "你可以将一张方块牌当一张【乐不思蜀】使用。",
            "流离": "当你成为【杀】的目标时，你可以弃置一张牌并选择一名与你的距离为<3>以内且可以合法成为【杀】的目标的其他角色，然后令该角色代替你成为此【杀】的目标。"
        }
    },
    "陆逊": {
        "势力": "吴",
        "称号": "儒生雄才",
        "体力上限": 3,
        "性别": "男",
        "拼音": "luxun",
        "分包": "标准",
        "技能": {
            "炎灭": "出牌阶段限一次，你可以将一张红桃手牌当一张【火烧连营】使用。",
            "智变": "出牌阶段限一次，你可以将一张手牌交给一名与你的距离为<3>以内的其他角色，然后你控制其执行一次步数为1的移动。"
        }
    },
    "孙尚香": {
        "势力": "吴",
        "称号": "弓腰姬",
        "体力上限": 3,
        "性别": "女",
        "拼音": "sunshangxiang",
        "分包": "标准",
        "技能": {
            "结姻": "出牌阶段限一次，你可以选择一名与你的距离为<3>以内且已受伤的男性角色并弃置两张手牌，然后你和该角色各回复1点体力。",
            "枭姬": "当你失去装备区里的一张牌后，你可以摸两张牌。"
        }
    },
    "祖茂": {
        "势力": "吴",
        "称号": "杀身成仁",
        "体力上限": 4,
        "性别": "男",
        "拼音": "zumao",
        "分包": "众筹解锁",
        "技能": {
            "诱兵": "移动阶段开始时，你可以选择一名与你的距离为<4>以内的其他非主帅角色；若如此做，当你于本阶段移动一步后，你控制该角色执行一次步数为1且方向与你此步移动相同的移动。"
        }
    },
    "华佗": {
        "势力": "群",
        "称号": "神医",
        "体力上限": 3,
        "性别": "男",
        "拼音": "huatuo",
        "分包": "标准",
        "技能": {
            "急救": "你的回合外，你可以将一张红色牌当一张【桃】使用。",
            "青囊": "出牌阶段限一次，你可以弃置一张手牌，并选择一名与你的距离为<1>以内且已受伤的角色，然后该角色回复1点体力。"
        }
    },
    "吕布": {
        "势力": "群",
        "称号": "武的化身",
        "体力上限": 4,
        "性别": "男",
        "拼音": "lvbu",
        "分包": "标准",
        "技能": {
            "无双": "锁定技，当你使用【杀】指定目标后，该角色需依次使用两张【闪】才能抵消此【杀】。当你使用【决斗】指定一名角色为目标后，或当你成为其他角色使用的【决斗】的目标后，该角色每次响应此【决斗】需依次打出两张【杀】。",
            "虓勇": "锁定技，若你的装备区里有牌，你装备区里的牌无效，且视为你装备着【方天画戟】和【赤兔】。"
        }
    },
    "貂蝉": {
        "势力": "群",
        "称号": "绝世的舞姬",
        "体力上限": 3,
        "性别": "女",
        "拼音": "diaochan",
        "分包": "标准",
        "技能": {
            "离间": "出牌阶段限一次，你可以弃置一张牌，并选择一名与你的距离为<1>以内的男性角色和该角色可以合法使用【决斗】的另一名男性角色，然后前者视为对后者使用一张【决斗】。",
            "闭月": "结束阶段，你可以摸一张牌。"
        }
    },
    "董卓": {
        "势力": "群",
        "称号": "魔王",
        "体力上限": 4,
        "性别": "男",
        "拼音": "dongzhuo",
        "分包": "众筹解锁",
        "技能": {
            "拥权": "锁定技，若你的距离<1>范围内有其它己方角色，你不能成为敌方角色使用牌或发动技能的目标。",
            "纵害": "每回合限一次，当与你的距离为<1>以内的其他己方角色对敌方角色造成伤害后，你可以摸一张牌，然后将一张牌交给该角色。"
        }
    },
    "张绣": {
        "势力": "群",
        "称号": "北地枪王",
        "体力上限": 4,
        "性别": "男",
        "拼音": "zhangxiu",
        "分包": "众筹解锁",
        "技能": {
            "冲杀": "当你于移动阶段声明你执行的移动时，你可以进入有敌方角色的区域；当你移动一步后，若你进入有敌方角色的区域：若该角色可以执行步数为1且方向与你相同的移动，你控制其执行之；若该角色不可以执行步数为1且方向与你相同的移动且其可以转移，你控制其转移至与其距离最近的可进入区域，然后你对该角色造成1点普通伤害，并结束你的移动结算。"
        }
    },
    "刘表": {
        "势力": "群",
        "称号": "跨蹈汉南",
        "体力上限": 4,
        "性别": "男",
        "拼音": "liubiao",
        "分包": "帷幄千里-天",
        "技能": {
            "星占": "出牌阶段限一次，你可以弃置一张手牌，然后将“风向”改为此牌花色对应的方向并摸一张牌。",
            "逐流": "出牌阶段限一次，你可以将一张手牌与牌堆底的一张牌交换，然后进行一次额外的“起风”结算。"
        }
    },
    "曹仁": {
        "势力": "魏",
        "称号": "大将军",
        "体力上限": 4,
        "性别": "男",
        "拼音": "caoren",
        "分包": "帷幄千里-天",
        "技能": {
            "固城": "锁定技，敌方角色不能因任何效果进入己方角色所在的区域（敌方大本营除外）。",
            "退守": "锁定技，当敌方阵营因己方角色死亡而得分时，你令此分数-1。"
        }
    },
    "魏延": {
        "势力": "蜀",
        "称号": "嗜血的独狼",
        "体力上限": 4,
        "性别": "男",
        "拼音": "weiyan",
        "分包": "帷幄千里-天",
        "技能": {
            "狂骨": "当你对一名与你的距离为<1>以内的角色造成1点伤害后，你可以回复1点体力。",
            "缠斗": "锁定技，与你的距离为<1>以内的敌方角色的移动阶段开始前，该角色选择一项：1.其弃置一张【闪】；2.其跳过此阶段。"
        }
    },
    "祝融": {
        "势力": "蜀",
        "称号": "野性的女王",
        "体力上限": 4,
        "性别": "女",
        "拼音": "zhurong",
        "分包": "帷幄千里-天",
        "技能": {
            "蛮刃": "锁定技，当你因【杀】的效果对一名目标角色造成伤害时，若你已击杀过敌方角色，此伤害值改为X点（X为目标角色的体力值）。",
            "巨象": "锁定技，当一张【南蛮入侵】对你的结算开始时，此【南蛮入侵】对你无效。当其他角色使用的【南蛮入侵】结算结束后，若你是此【南蛮入侵】的目标，你获得此【南蛮入侵】。"
        }
    },
    "孙坚": {
        "势力": "吴",
        "称号": "武烈帝",
        "体力上限": 4,
        "性别": "男",
        "拼音": "sunjian",
        "分包": "帷幄千里-天",
        "技能": {
            "兵威": "出牌阶段限一次，你可以选择一项：1.若你为主帅，你将帅旗交给一名与你的距离为<5>以内的己方角色，然后该角色回复1点体力；2.若与你的距离为<5>以内的其他己方角色为主帅，其将帅旗交给你，然后你执行一次步数为1的移动。"
        }
    },
    "鲁肃": {
        "势力": "吴",
        "称号": "独断的外交家",
        "体力上限": 3,
        "性别": "男",
        "拼音": "lusu",
        "分包": "帷幄千里-天",
        "技能": {
            "卸兵": "出牌阶段限一次，你可以弃置一名与你的距离为<4>以内的敌方角色的一张牌，若如此做，你与其各摸一张牌，然后你可以将一张手牌交给一名与你的距离为<2>以内的其他己方角色。",
            "无惧": "锁定技，当一张红色【杀】对你的结算开始时，此【杀】对你无效。"
        }
    },
    "张角": {
        "势力": "群",
        "称号": "天公将军",
        "体力上限": 3,
        "性别": "男",
        "拼音": "zhangjiao",
        "分包": "帷幄千里-天",
        "技能": {
            "群蚑": "当你因【杀】的效果对一名角色造成伤害后，你可以对另一名与该角色的距离为1以内的角色造成等量的普通伤害。",
            "太平": "限定技，出牌阶段，你可以对所有其距离1范围内没有另一名角色的其他角色造成1点普通伤害。"
        }
    },
    "陈宫": {
        "势力": "群",
        "称号": "刚直壮烈",
        "体力上限": 3,
        "性别": "男",
        "拼音": "chengong",
        "分包": "帷幄千里-天",
        "技能": {
            "明策": "出牌阶段限一次，你可以展示一张装备牌或【杀】并将其交给一名与你的距离为<3>以内且攻击范围内有目标的其他己方角色，然后其选择一项：1.其视为对其攻击范围内的另一名角色使用一张普【杀】；2.其摸一张牌。",
            "智迟": "锁定技，当你于回合外受到伤害后，直到当前回合结束，【杀】和普通锦囊牌对你无效。"
        }
    },
    "邓艾": {
        "势力": "魏",
        "称号": "矫然的壮士",
        "体力上限": 4,
        "性别": "男",
        "拼音": "dengai",
        "分包": "帷幄千里-地",
        "技能": {
            "勘地": "你可在对应地形不为大本营或“工事”地形的区域建造任何“工事”。",
            "急袭": "其他己方角色的移动阶段开始时，若其与你的距离为<1>以内，其可以改为生成至多X点移动力（X为其体力值）。"
        }
    },
    "荀彧": {
        "势力": "魏",
        "称号": "王佐之才",
        "体力上限": 3,
        "性别": "男",
        "拼音": "xunyu",
        "分包": "帷幄千里-地",
        "技能": {
            "驱虎": "出牌阶段限一次，你可以与一名与你的距离为<5>以内的其他角色拼点：若你赢，你控制其执行一次步数至多为2的移动；若你没赢，其对你造成1点普通伤害。",
            "节命": "当你受到1点伤害后，你可以令一名与你的距离为<3>以内的角色摸X张牌（X为你的已损失体力值）。"
        }
    },
    "孟获": {
        "势力": "蜀",
        "称号": "南蛮王",
        "体力上限": 4,
        "性别": "男",
        "拼音": "menghuo",
        "分包": "帷幄千里-地",
        "技能": {
            "祸首": "锁定技，当一张【南蛮入侵】对一名己方角色的结算开始时，此【南蛮入侵】对其无效。你使用的【南蛮入侵】不能被【杀】响应。当己方阵营因你击杀敌方角色而得分时，若造成此伤害的牌是【南蛮入侵】，此分数+1。",
            "蛮王": "其他己方角色出牌阶段限一次，其可以展示并交给你一张【南蛮入侵】或【杀】。"
        }
    },
    "法正": {
        "势力": "蜀",
        "称号": "蜀汉的辅翼",
        "体力上限": 3,
        "性别": "男",
        "拼音": "fazheng",
        "分包": "帷幄千里-地",
        "技能": {
            "蓄锐": "移动阶段，若你不位于大本营或军营地形，你可以放弃移动，并将一张牌交给一名与你的距离为<4>以内的其他角色，然后其可以使用一张【杀】，此【杀】无距离限制，且此【杀】指定目标后，目标角色所在地形的效果失效。",
            "伺机": "出牌阶段限一次，你可以转移至一个与你的距离为<3>以内的可进入空区域；若如此做，当你使用下一张牌结算结束后，或出牌阶段结束时，你转移至原区域（若原区域不可进入，则改为转移至与原区域距离最近的可进入区域）。"
        }
    },
    "孙策": {
        "势力": "吴",
        "称号": "江东的小霸王",
        "体力上限": 4,
        "性别": "男",
        "拼音": "sunce",
        "分包": "帷幄千里-地",
        "技能": {
            "激昂": "当你使用【决斗】或红色【杀】指定目标后，或当你成为【决斗】或红色【杀】的目标后，你可以摸一张牌。",
            "猘勇": "准备阶段，若你的体力值为1，你可以摸两张牌，然后你执行一次步数至多为2的移动。"
        }
    },
    "贾诩": {
        "势力": "群",
        "称号": "冷酷的毒士",
        "体力上限": 3,
        "性别": "男",
        "拼音": "jiaxu",
        "分包": "帷幄千里-地",
        "技能": {
            "完杀": "锁定技，你的回合内，只有你和处于濒死结算的角色才能使用【桃】。",
            "帷幕": "锁定技，你不能成为黑色锦囊牌的目标。",
            "乱武": "限定技，出牌阶段，你可以控制任意名其他角色分别执行一次步数为1的移动，然后你令所有其他角色依次选择一项：1.其对与其距离为1以内的另一名角色使用一张【杀】；2.其失去1点体力。"
        }
    },
    "庞德": {
        "势力": "群",
        "称号": "人马一体",
        "体力上限": 4,
        "性别": "男",
        "拼音": "pangde",
        "分包": "帷幄千里-地",
        "技能": {
            "马术": "出牌阶段，你可以消耗任意点移动力，然后你执行一次等量步数的移动。",
            "决死": "出牌阶段限一次，若你本回合移动阶段未被跳过且当前移动力为0，你可以将一张红色基本牌当一张【决斗】使用。"
        }
    },
    "高顺": {
        "势力": "群",
        "称号": "攻无不克",
        "体力上限": 4,
        "性别": "男",
        "拼音": "gaoshun",
        "分包": "帷幄千里-地",
        "技能": {
            "陷阵": "锁定技，你的回合内，你使用【杀】的使用次数限制+X，且你的攻击范围+X（X为你的已损失体力值）。",
            "死志": "移动阶段开始时，你可以失去任意点体力，若如此做，出牌阶段结束时，你回复等量的体力。"
        }
    },
    "华雄": {
        "势力": "群",
        "称号": "魔将",
        "体力上限": 4,
        "性别": "男",
        "拼音": "huaxiong",
        "分包": "帷幄千里-将",
        "技能": {
            "耀武": "锁定技，当己方阵营因“单挑”结算而得分时，若你获得“完胜”，此分数+1。",
            "恃勇": "锁定技，当你受到与你的距离为1或2的角色使用的【杀】造成的伤害时：若此【杀】为黑色，此伤害值-1；若此【杀】为红色，此伤害值+1。"
        }
    },
    "夏侯渊": {
        "势力": "魏",
        "称号": "疾行的猎豹",
        "体力上限": 4,
        "性别": "男",
        "拼音": "xiahouyuan",
        "分包": "帷幄千里-将",
        "技能": {
            "神速": "回合开始时，你可以执行一次步数至多为X的移动（X为你上回合未消耗的移动力）。"
        }
    },
    "姜维": {
        "势力": "蜀",
        "称号": "龙的衣钵",
        "体力上限": 4,
        "性别": "男",
        "拼音": "jiangwei",
        "分包": "帷幄千里-将",
        "技能": {
            "挑衅": "出牌阶段限一次，你可以选择一名攻击范围内含有你的其他角色，然后该角色选择一项：1.其对你使用一张【杀】；2.你弃置其一张牌。",
            "智继": "当你需要使用【无懈可击】时，若所有敌方角色的攻击范围内均没有你，你可以失去1点体力，然后视为你使用一张【无懈可击】。"
        }
    },
    "小乔": {
        "势力": "吴",
        "称号": "矫情之花",
        "体力上限": 3,
        "性别": "女",
        "拼音": "xiaoqiao",
        "分包": "帷幄千里-将",
        "技能": {
            "天香": "出牌阶段限一次，你可以将一张手牌交给与你的距离为<3>以内的其他角色，然后该角色回复1点体力，你失去1点体力。",
            "红颜": "锁定技，准备阶段，你回复体力至3点。"
        }
    },
    "乐进&李典": {
        "势力": "魏",
        "称号": "奋强突固&深明大义",
        "体力上限": 4,
        "性别": "男",
        "拼音": "yuejin&lidian",
        "分包": "帷幄千里-将",
        "技能": {
            "骁果": "（乐进面技能）结束阶段，你可以选择一名与你的距离为<4>以内的敌方角色并弃置一张基本牌，然后其选择一项：1.其弃置一张装备牌；2.你对其造成1点普通伤害。",
            "忘隙": "（李典面技能）每回合限一次，当其他角色使用的牌结算结束后，若你是此牌的目标且没有角色处于濒死状态，你可以执行一次步数为1的移动。"
        }
    },
    "关兴&张苞": {
        "势力": "蜀",
        "称号": "青龙血脉&燕人血脉",
        "体力上限": 4,
        "性别": "男",
        "拼音": "guanxing&zhangbao",
        "分包": "帷幄千里-将",
        "技能": {
            "龙倚": "（关兴面技能）锁定技，当一名与你的距离为<4>以内的其他己方角色因红色【杀】的效果而造成伤害时，此伤害值+1。",
            "虎助": "（张苞面技能）锁定技，当一名与你的距离为<4>以内的其他己方角色使用【杀】时，若此【杀】是其他己方角色于当前回合内使用的第一张【杀】，其进行判定，若结果为黑色，其获得此牌。"
        }
    },
    "张昭&张纮": {
        "势力": "吴",
        "称号": "忠謇方直&尚古人臣",
        "体力上限": 3,
        "性别": "男",
        "拼音": "zhangzhao&zhanghong",
        "分包": "帷幄千里-将",
        "技能": {
            "直谏": "（张昭面技能）出牌阶段，你可以将手牌中的一张装备牌置于距离<3>以内的其他己方角色的装备区里，然后你选择一项：1.你摸一张牌，然后其执行一次步数为1的移动；2.其摸一张牌，然后你执行一次步数为1的移动。",
            "固政": "（张纮面技能）每回合限一次，当一张装备牌进入弃牌堆后，若这张牌进入弃牌堆前是距离<4>以内的其他角色的牌，你可以获得这张牌。"
        }
    },
    "颜良&文丑": {
        "势力": "群",
        "称号": "车骑左驾&车骑右驾",
        "体力上限": 4,
        "性别": "男",
        "拼音": "yanliang&wenchou",
        "分包": "帷幄千里-将",
        "技能": {
            "骁将": "（颜良面技能）锁定技，当你的棋子从正面翻至反面后，若你的装备区有牌且场上有至少一名你可以合法使用【决斗】的敌方角色，你弃置你装备区里的所有牌并选择其中一名角色，然后你视为对其使用一张【决斗】。",
            "勇冠": "（文丑面技能）锁定技，当你的棋子从反面翻至正面后，若你的距离<5>范围内有敌方角色，你选择一名与你的距离为<5>以内的敌方角色，然后其视为对你使用一张【决斗】，此【决斗】的距离限制为<5>。"
        }
    },
    "程普": {
        "势力": "吴",
        "称号": "三朝虎臣",
        "体力上限": 4,
        "性别": "男",
        "拼音": "chengpu",
        "分包": "帷幄千里-法",
        "技能": {
            "军势": "你移动“步旅”无方向限制。",
            "旌旗": "当己方有“阵法”生效时，你可以将其效果改为其他“阵法”的效果。"
        }
    },
    "张郃": {
        "势力": "魏",
        "称号": "料敌机先",
        "体力上限": 4,
        "性别": "男",
        "拼音": "zhanghe",
        "分包": "帷幄千里-法",
        "技能": {
            "斡旋": "当一名与你的距离为<3>以内的角色使用装备牌时，你可以执行一次步数为1的移动。",
            "巧变": "出牌阶段限一次，你可以选择一名与你的距离为<1>以内的敌方角色，并弃置一张手牌，然后你获得其装备区里的一张牌。"
        }
    },
    "徐晃": {
        "势力": "魏",
        "称号": "周亚夫之风",
        "体力上限": 4,
        "性别": "男",
        "拼音": "xuhuang",
        "分包": "帷幄千里-法",
        "技能": {
            "断粮": "与你的距离为<3>以内的敌方角色的摸牌阶段开始时，若其不位于平原或擂台地形，你可以令其弃置一张牌。",
            "荡寇": "当你使用的【杀】被所在地形与你相同的目标角色使用的【闪】抵消后，你可以控制其执行一次步数为1的移动。"
        }
    },
    "于禁": {
        "势力": "魏",
        "称号": "讨暴坚垒",
        "体力上限": 4,
        "性别": "男",
        "拼音": "yujin",
        "分包": "帷幄千里-法",
        "技能": {
            "节钺": "出牌阶段限一次，你可以选择一名与你的距离为<3>以内且与你位于同一直线的其他角色，将其转移至该角色所在的方向上与你的距离最近的可进入区域，若如此做，本回合你不能对其使用牌。",
            "砺军": "锁定技，当一名其他角色的位置于你的回合内发生变化时，其摸一张牌。"
        }
    },
    "庞统": {
        "势力": "蜀",
        "称号": "凤雏",
        "体力上限": 3,
        "性别": "男",
        "拼音": "pangtong",
        "分包": "帷幄千里-法",
        "技能": {
            "秘策": "你可以将所有手牌当一张【奇门遁甲】使用。当你使用【奇门遁甲】时，你可以与你声明的目标角色交换各自装备区里的一张牌。",
            "兴道": "出牌阶段限一次，你可以令所有手牌数为0的己方角色各摸一张牌。",
            "展骥": "锁定技，你的装备区有两个防具栏和两个坐骑栏。"
        }
    },
    "太史慈": {
        "势力": "吴",
        "称号": "笃烈之士",
        "体力上限": 4,
        "性别": "男",
        "拼音": "taishici",
        "分包": "帷幄千里-法",
        "技能": {
            "天义": "每名角色的出牌阶段限一次，当你移动或转移后，你可以与你攻击范围内的一名角色拼点：若你赢，你可以额外使用一张【杀】，此【杀】可以额外选择任意名你攻击范围内的角色。",
            "良驹": "锁定技，你的坐骑牌视为【大宛】。"
        }
    },
    "周泰": {
        "势力": "吴",
        "称号": "历战之躯",
        "体力上限": 4,
        "性别": "男",
        "拼音": "zhoutai",
        "分包": "帷幄千里-法",
        "技能": {
            "不屈": "当你或与你的距离为<2>以内的其他角色进入濒死结算时，你可以回复1点体力。",
            "奋激": "回合开始时，你可以消耗己方阵营的1~3分，然后你回复X点体力并摸2X张牌（X为你此次消耗的分数）。"
        }
    },
    "韩当": {
        "势力": "吴",
        "称号": "石城侯",
        "体力上限": 4,
        "性别": "男",
        "拼音": "handang",
        "分包": "帷幄千里-法",
        "技能": {
            "解烦": "出牌阶段限一次，你可以弃置一张牌，然后令所有攻击范围内含有己方主帅的敌方角色依次选择一项：1.弃置一张装备牌；2.令该主帅摸一张牌。",
            "弓骑": "当你需要使用射【杀】时，若当前回合内有装备牌因弃置而进入弃牌堆，你可以将一张【杀】当一张射【杀】使用。"
        }
    },
    "程昱": {
        "势力": "魏",
        "称号": "泰山捧日",
        "体力上限": 3,
        "性别": "男",
        "拼音": "chengyu",
        "分包": "Promo",
        "技能": {
            "伏兵": "一名敌方角色的移动阶段结束时，你可以弃置一张点数为X的牌（X为该角色所在区域的一个坐标值），然后你弃置其两张牌（不足则全弃）。",
            "刚戾": "锁定技，若你已受伤，你手牌中点数大于7的牌点数-7。"
        }
    },
    "袁绍": {
        "势力": "群",
        "称号": "高贵的名门",
        "体力上限": 4,
        "性别": "男",
        "拼音": "yuanshao",
        "分包": "Promo",
        "技能": {
            "乱击": "出牌阶段限一次，你可以将两张花色相同的手牌当一张【万箭齐发】使用。你使用【万箭齐发】的距离限制+1。当你使用【万箭齐发】指定目标时，你可以取消一个目标。",
            "血裔": "锁定技，你的手牌上限+2X（X为己方群雄势力角色数）。"
        }
    },
    "刘协": {
        "势力": "群",
        "称号": "受困天子",
        "体力上限": 3,
        "性别": "男",
        "拼音": "liuxie",
        "分包": "Promo",
        "技能": {
            "汉德": "锁定技，与你的距离为<4>以内的其他己方角色的手牌上限+1。与你的距离为<4>以内的敌方角色的手牌上限-1。",
            "天幸": "锁定技，当你非因发动〖天幸〗而回复体力时，你选择一项：1.你回复1点体力；2.你摸一张牌。"
        }
    },
    "卑弥呼": {
        "势力": "群",
        "称号": "亲魏倭王",
        "体力上限": 3,
        "性别": "女",
        "拼音": "himiko",
        "分包": "Promo",
        "技能": {
            "纵傀": "出牌阶段，若场上“傀儡”的数量小于3，你可以在一个与你的距离为<4>以内的可进入空区域上放置一枚“傀儡”。当敌方角色进入有“傀儡”的区域时，移去此“傀儡”并中止当前移动，然后直到该角色的下个回合开始：其无法移动或转移；当其受到【杀】造成的伤害时，若其为此【杀】的目标，此伤害值+1。"
        }
    },
    "王异": {
        "势力": "魏",
        "称号": "决意的巾帼",
        "体力上限": 3,
        "性别": "女",
        "拼音": "wangyi",
        "分包": "臻藏版",
        "技能": {
            "拒敌": "锁定技，敌方角色的移动阶段开始时，若其在你的距离<4>范围内，其少生成1点移动力，且本回合其不能于出牌阶段内移动。",
            "秘计": "锁定技，你的距离<3>范围内的敌方角色使用锦囊牌的距离限制-X（X为你的已损失体力值）。当你受到与你的距离为<3>以内的敌方角色使用的锦囊牌造成的伤害时，你防止此伤害。"
        }
    },
    "左慈": {
        "势力": "群",
        "称号": "谜之仙人",
        "体力上限": 3,
        "性别": "男",
        "拼音": "zuoci",
        "分包": "Promo",
        "技能": {
            "山隐": "锁定技，你不能成为主帅，且你的牌没有花色。",
            "神行": "移动阶段开始前，你可以跳过此阶段，然后转移至一个可进入空区域。",
            "掷杯": "一名其他角色的移动阶段结束后，若你的距离<1>范围内有至少两名敌方角色，你可以获得一个额外的移动阶段。"
        }
    }
};

// 游戏牌堆
const DECK = [
    {
        "color": "黑桃",
        "number": "A",
        "name": "【决斗】",
        "fanti": "【決鬥】"
    },
    {
        "color": "黑桃",
        "number": "2",
        "name": "【雌雄双股剑】",
        "fanti": "【雌雄雙股劍】"
    },
    {
        "color": "黑桃",
        "number": "3",
        "name": "【过河拆桥】",
        "fanti": "【過河拆橋】"
    },
    {
        "color": "黑桃",
        "number": "4",
        "name": "【过河拆桥】",
        "fanti": "【過河拆橋】"
    },
    {
        "color": "黑桃",
        "number": "5",
        "name": "【青龙偃月刀】",
        "fanti": "【青龍偃月刀】"
    },
    {
        "color": "黑桃",
        "number": "6",
        "name": "【乐不思蜀】",
        "fanti": "【樂不思蜀】"
    },
    {
        "color": "黑桃",
        "number": "7",
        "name": "【南蛮入侵】",
        "fanti": "【南蠻入侵】"
    },
    {
        "color": "黑桃",
        "number": "8",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "黑桃",
        "number": "9",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "黑桃",
        "number": "10",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "黑桃",
        "number": "J",
        "name": "【奇门遁甲】",
        "fanti": "【奇門遁甲】"
    },
    {
        "color": "黑桃",
        "number": "Q",
        "name": "【丈八蛇矛】",
        "fanti": "【丈八蛇矛】"
    },
    {
        "color": "黑桃",
        "number": "K",
        "name": "【大宛】",
        "fanti": "【大宛】"
    },
    {
        "color": "黑桃",
        "number": "A",
        "name": "【兵贵神速】",
        "fanti": "【兵貴神速】"
    },
    {
        "color": "黑桃",
        "number": "2",
        "name": "【八卦阵】",
        "fanti": "【八卦陣】"
    },
    {
        "color": "黑桃",
        "number": "3",
        "name": "【奇门遁甲】",
        "fanti": "【奇門遁甲】"
    },
    {
        "color": "黑桃",
        "number": "4",
        "name": "【奇门遁甲】",
        "fanti": "【奇門遁甲】"
    },
    {
        "color": "黑桃",
        "number": "5",
        "name": "【绝影】",
        "fanti": "【絕影】"
    },
    {
        "color": "黑桃",
        "number": "6",
        "name": "【青缸剑】",
        "fanti": "【青缸劍】"
    },
    {
        "color": "黑桃",
        "number": "7",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "黑桃",
        "number": "8",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "黑桃",
        "number": "9",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "黑桃",
        "number": "10",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "黑桃",
        "number": "J",
        "name": "【无懈可击】",
        "fanti": "【無懈可擊】"
    },
    {
        "color": "黑桃",
        "number": "Q",
        "name": "【过河拆桥】",
        "fanti": "【過河拆橋】"
    },
    {
        "color": "黑桃",
        "number": "K",
        "name": "【南蛮入侵】",
        "fanti": "【南蠻入侵】"
    },
    {
        "color": "黑桃",
        "number": "2",
        "name": "【寒冰剑】",
        "fanti": "【寒冰劍】"
    },
    {
        "color": "红桃",
        "number": "A",
        "name": "【万箭齐发】",
        "fanti": "【萬箭齊發】"
    },
    {
        "color": "红桃",
        "number": "2",
        "name": "【闪】",
        "fanti": "【閃】"
    },
    {
        "color": "红桃",
        "number": "3",
        "name": "【火烧连营】",
        "fanti": "【火燒連營】"
    },
    {
        "color": "红桃",
        "number": "4",
        "name": "【桃】",
        "fanti": "【桃】"
    },
    {
        "color": "红桃",
        "number": "5",
        "name": "【赤兔】",
        "fanti": "【赤兔】"
    },
    {
        "color": "红桃",
        "number": "6",
        "name": "【乐不思蜀】",
        "fanti": "【樂不思蜀】"
    },
    {
        "color": "红桃",
        "number": "7",
        "name": "【桃】",
        "fanti": "【桃】"
    },
    {
        "color": "红桃",
        "number": "8",
        "name": "【无中生有】",
        "fanti": "【無中生有】"
    },
    {
        "color": "红桃",
        "number": "9",
        "name": "【桃】",
        "fanti": "【桃】"
    },
    {
        "color": "红桃",
        "number": "10",
        "name": "射【杀】",
        "fanti": "射【殺】"
    },
    {
        "color": "红桃",
        "number": "J",
        "name": "【无中生有】",
        "fanti": "【無中生有】"
    },
    {
        "color": "红桃",
        "number": "Q",
        "name": "【过河拆桥】",
        "fanti": "【過河拆橋】"
    },
    {
        "color": "红桃",
        "number": "K",
        "name": "【爪黄飞电】",
        "fanti": "【爪黃飛電】"
    },
    {
        "color": "红桃",
        "number": "A",
        "name": "【桃园结义】",
        "fanti": "【桃園結義】"
    },
    {
        "color": "红桃",
        "number": "2",
        "name": "【闪】",
        "fanti": "【閃】"
    },
    {
        "color": "红桃",
        "number": "3",
        "name": "【桃】",
        "fanti": "【桃】"
    },
    {
        "color": "红桃",
        "number": "4",
        "name": "【火烧连营】",
        "fanti": "【火燒連營】"
    },
    {
        "color": "红桃",
        "number": "5",
        "name": "【火烧连营】",
        "fanti": "【火燒連營】"
    },
    {
        "color": "红桃",
        "number": "6",
        "name": "【桃】",
        "fanti": "【桃】"
    },
    {
        "color": "红桃",
        "number": "7",
        "name": "【无中生有】",
        "fanti": "【無中生有】"
    },
    {
        "color": "红桃",
        "number": "8",
        "name": "【桃】",
        "fanti": "【桃】"
    },
    {
        "color": "红桃",
        "number": "9",
        "name": "【无中生有】",
        "fanti": "【無中生有】"
    },
    {
        "color": "红桃",
        "number": "10",
        "name": "射【杀】",
        "fanti": "射【殺】"
    },
    {
        "color": "红桃",
        "number": "J",
        "name": "射【杀】",
        "fanti": "射【殺】"
    },
    {
        "color": "红桃",
        "number": "Q",
        "name": "【桃】",
        "fanti": "【桃】"
    },
    {
        "color": "红桃",
        "number": "K",
        "name": "【闪】",
        "fanti": "【閃】"
    },
    {
        "color": "红桃",
        "number": "Q",
        "name": "【兵贵神速】",
        "fanti": "【兵貴神速】"
    },
    {
        "color": "梅花",
        "number": "A",
        "name": "【兵贵神速】",
        "fanti": "【兵貴神速】"
    },
    {
        "color": "梅花",
        "number": "2",
        "name": "【八卦阵】",
        "fanti": "【八卦陣】"
    },
    {
        "color": "梅花",
        "number": "3",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "梅花",
        "number": "4",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "梅花",
        "number": "5",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "梅花",
        "number": "6",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "梅花",
        "number": "7",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "梅花",
        "number": "8",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "梅花",
        "number": "9",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "梅花",
        "number": "10",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "梅花",
        "number": "J",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "梅花",
        "number": "Q",
        "name": "【无懈可击】",
        "fanti": "【無懈可擊】"
    },
    {
        "color": "梅花",
        "number": "K",
        "name": "【水淹七军】",
        "fanti": "【淹水七軍】"
    },
    {
        "color": "梅花",
        "number": "A",
        "name": "【决斗】",
        "fanti": "【決鬥】"
    },
    {
        "color": "梅花",
        "number": "2",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "梅花",
        "number": "3",
        "name": "【过河拆桥】",
        "fanti": "【過河拆橋】"
    },
    {
        "color": "梅花",
        "number": "4",
        "name": "【过河拆桥】",
        "fanti": "【過河拆橋】"
    },
    {
        "color": "梅花",
        "number": "5",
        "name": "【的卢】",
        "fanti": "【的盧】"
    },
    {
        "color": "梅花",
        "number": "6",
        "name": "【乐不思蜀】",
        "fanti": "【樂不思蜀】"
    },
    {
        "color": "梅花",
        "number": "7",
        "name": "【南蛮入侵】",
        "fanti": "【南蠻入侵】"
    },
    {
        "color": "梅花",
        "number": "8",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "梅花",
        "number": "9",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "梅花",
        "number": "10",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "梅花",
        "number": "J",
        "name": "【杀】",
        "fanti": "【殺】"
    },
    {
        "color": "梅花",
        "number": "Q",
        "name": "【水淹七军】",
        "fanti": "【淹水七軍】"
    },
    {
        "color": "梅花",
        "number": "K",
        "name": "【无懈可击】",
        "fanti": "【無懈可擊】"
    },
    {
        "color": "梅花",
        "number": "2",
        "name": "【仁王盾】",
        "fanti": "【仁王盾】"
    },
    {
        "color": "方块",
        "number": "A",
        "name": "【决斗】",
        "fanti": "【決鬥】"
    },
    {
        "color": "方块",
        "number": "2",
        "name": "【闪】",
        "fanti": "【閃】"
    },
    {
        "color": "方块",
        "number": "3",
        "name": "【闪】",
        "fanti": "【閃】"
    },
    {
        "color": "方块",
        "number": "4",
        "name": "【朱雀羽扇】",
        "fanti": "【朱雀羽扇】"
    },
    {
        "color": "方块",
        "number": "5",
        "name": "【贯石斧】",
        "fanti": "【貫石斧】"
    },
    {
        "color": "方块",
        "number": "6",
        "name": "射【杀】",
        "fanti": "射【殺】"
    },
    {
        "color": "方块",
        "number": "7",
        "name": "【闪】",
        "fanti": "【閃】"
    },
    {
        "color": "方块",
        "number": "8",
        "name": "【闪】",
        "fanti": "【閃】"
    },
    {
        "color": "方块",
        "number": "9",
        "name": "【闪】",
        "fanti": "【閃】"
    },
    {
        "color": "方块",
        "number": "10",
        "name": "射【杀】",
        "fanti": "射【殺】"
    },
    {
        "color": "方块",
        "number": "J",
        "name": "【闪】",
        "fanti": "【閃】"
    },
    {
        "color": "方块",
        "number": "Q",
        "name": "【桃】",
        "fanti": "【桃】"
    },
    {
        "color": "方块",
        "number": "K",
        "name": "射【杀】",
        "fanti": "射【殺】"
    },
    {
        "color": "方块",
        "number": "A",
        "name": "【诸葛连弩】",
        "fanti": "【諸葛連弩】"
    },
    {
        "color": "方块",
        "number": "2",
        "name": "【闪】",
        "fanti": "【閃】"
    },
    {
        "color": "方块",
        "number": "3",
        "name": "【火烧连营】",
        "fanti": "【火燒連營】"
    },
    {
        "color": "方块",
        "number": "4",
        "name": "【闪】",
        "fanti": "【閃】"
    },
    {
        "color": "方块",
        "number": "5",
        "name": "【闪】",
        "fanti": "【閃】"
    },
    {
        "color": "方块",
        "number": "6",
        "name": "【闪】",
        "fanti": "【閃】"
    },
    {
        "color": "方块",
        "number": "7",
        "name": "射【杀】",
        "fanti": "射【殺】"
    },
    {
        "color": "方块",
        "number": "8",
        "name": "射【杀】",
        "fanti": "射【殺】"
    },
    {
        "color": "方块",
        "number": "9",
        "name": "射【杀】",
        "fanti": "射【殺】"
    },
    {
        "color": "方块",
        "number": "10",
        "name": "【闪】",
        "fanti": "【閃】"
    },
    {
        "color": "方块",
        "number": "J",
        "name": "【闪】",
        "fanti": "【閃】"
    },
    {
        "color": "方块",
        "number": "Q",
        "name": "【方天画戟】",
        "fanti": "【方天畫戟】"
    },
    {
        "color": "方块",
        "number": "K",
        "name": "【紫骅】",
        "fanti": "【紫騁】"
    },
    {
        "color": "方块",
        "number": "Q",
        "name": "【无懈可击】",
        "fanti": "【無懈可擊】"
    }
];

function format_skill(text)
{
    const skillLabels = ["锁定技", "限定技"];
    for (const label of skillLabels)
    {
        text = text.replace(label, "<span class='skill-label'>" + label + "</span>");
    }

    text = text.replace(/<(\d+)>/g, "＜<span class='skill-range'>$1</span>＞");

    text = text.replace(/“([\u4e00-\u9fa5]+)”/g, "“<span class='skill-term'>$1</span>”");

    text = text.replace(/〖([\u4e00-\u9fa5]+)〗/g, "〖<span class='skill-ref'>$1</span>〗");

    text = text.replace(/(（[\u4e00-\u9fa5]+面技能）)/g, "<span class='skill-side'>$1</span>");

    // text = text.replace(/\d/g, function(match) {
    //     return String.fromCharCode(match.charCodeAt(0) + 0xFEE0);
    // });

    // text = text.replace("黑桃", "<span class='skill-suit spade'>♠</span>");
    // text = text.replace("红桃", "<span class='skill-suit heart'>♥</span>");
    // text = text.replace("梅花", "<span class='skill-suit club'>♣</span>");
    // text = text.replace("方块", "<span class='skill-suit diamond'>♦</span>");

    text = text.replace("黑桃", '<i class="fas fa-spade" style="color: #000000;"></i>');
    text = text.replace("红桃", '<i class="fas fa-heart" style="color: #ff2e2e;"></i>');
    text = text.replace("梅花", '<i class="fas fa-club" style="color: #000000;"></i>');
    text = text.replace("方块", '<i class="fas fa-diamond" style="color: #ff2e2e;"></i>');

    text = text.replace("若结果为黑色", "若结果为<span class='skill-color-black'>黑色</span>");
    text = text.replace("若结果为红色", "若结果为<span class='skill-color-red'>红色</span>");

    return text;
}

// format every skill
for (let name in HERO_DATA)
{
    for (let skillName in HERO_DATA[name]["技能"])
    {
        HERO_DATA[name]["技能"][skillName] = format_skill(HERO_DATA[name]["技能"][skillName]);
    }
}

function format_terrain(text)
{
    const terrain_names = Object.keys(TERRAIN_INFO);
    for (const name of terrain_names)
    {
        text = text.replace(name, `<span style="color: ${TERRAIN_INFO[name]["color"]}">` + name + "</span>");
    }

    text = text.replace(/“([\u4e00-\u9fa5]+)”/g, "“<span class='skill-term'>$1</span>”");

    text = text.replace("黑桃", '<i class="fas fa-spade" style="color: #000000;"></i>');
    text = text.replace("红桃", '<i class="fas fa-heart" style="color: #ff2e2e;"></i>');
    text = text.replace("梅花", '<i class="fas fa-club" style="color: #000000;"></i>');
    text = text.replace("方块", '<i class="fas fa-diamond" style="color: #ff2e2e;"></i>');

    text = text.replace("若结果为黑色", "若结果为<span class='skill-color-black'>黑色</span>");
    text = text.replace("若结果为红色", "若结果为<span class='skill-color-red'>红色</span>");

    text = text.replace("。", "。<br>")

    return text;
}

// format every terrain info
for (let name in TERRAIN_INFO)
{
    TERRAIN_INFO[name]["地形效果"] = format_terrain(TERRAIN_INFO[name]["地形效果"]);
}


const weapons = {
    "": 1,
    "诸葛连弩": 1,
    "狂歌戟": 2,
    "长柄瓜锤": 2,
    "青缸剑": 2,
    "雌雄双股剑": 2,
    "寒冰剑": 2,
    "青龙偃月刀": 3,
    "丈八蛇矛": 3,
    "钩镰枪": 3,
    "贯石斧": 3,
    "朱雀羽扇": 4,
    "方天画戟": 4,
    "湛金枪": 4
}

const armors = {
    "": "",
    "八卦阵": "",
    "仁王盾": "",
    "护心镜": "",
    "磐石甲": ""
}

const horses = {
    "": "",
    "的卢":    "穿越",
    "绝影":    "穿越",
    "爪黄飞电": "穿越",
    "赤兔":    "移动",
    "大宛":    "移动",
    "紫骅":    "移动",
    "乌云踏雪": "阻动",
    "燎原火":   "阻动",
}

export { TERRAIN, TERRAIN_INFO, HERO_DATA, DECK, weapons, armors, horses };